doc/2023_02_09-mediation/post-mediation.org
#+TITLE: Mediation analysis
#+Author: 


Denote by \(Y\) an oucome, \(M\) a mediator, \(E\) an exposure, and
\(C\) possible confounders (between \(Y\) and \(E\), or \(Y\) and
\(M\), or \(E\) and \(M\)).
- \(Y(e,m)=Y(e,m,c)\) will be the counterfactual outcome, i.e. the outcome
  value had the exposure be set to \(e\), the mediator to \(m\), and the confounder set to \(c\).
- \(M(e)=M(e,c)\) will be the counterfactual mediator, i.e. the mediator
  value had the exposure be set to \(e\) and the confounder set to \(c\).

\bigskip

We define (all at a fixed confounder value \(c\)):
- the total effect as \(Y(e,M(e))-Y(e^*,M(e^*))\)
- the natural direct effect as \(Y(e,M(e))-Y(e^*,M(e))\)
- the indirect direct effect as \(Y(e^*,M(e))-Y(e^*,M(e^*))\)

* Binary outcome, continuous exposure
** Theory
We consider the following models:
#+BEGIN_EXPORT latex
\begin{align*}
\text{logit}\left(\Prob[Y=1|E,M,C]\right) &= \beta_0 + \beta_1 E + \beta_2 M + \beta_3 C \\
\Esp[M|E,C] &= \alpha_0 + \alpha_1 E + \alpha_3 C
\end{align*}
#+END_EXPORT

Therefore the counterfactual probability can be expressed as:
#+BEGIN_EXPORT latex
\begin{align*}
Y(e,M(e^*),c) &= \frac{1}{1+\exp^{-\beta_0 - \beta_1 e - \beta_2 M(e^*) + \beta_3 c}} \\
              &= \frac{1}{1+\exp^{-(\beta_0+\beta_2 \alpha_0) - (\beta_1 e + \beta_2 \alpha_1 e^*) + (\beta_3 + \beta_2 \alpha_3) c}} \\
\text{logit}\left(\Prob[Y(e,M(e^*),c)]\right) &= (\beta_0+\beta_2 \alpha_0) + (\beta_1 e + \beta_2 \alpha_1 e^*) + (\beta_3 + \beta_2 \alpha_3) c
\end{align*}
#+END_EXPORT

So the odd for the total effect is:
#+BEGIN_EXPORT latex
\[ OR^{TE} = \frac{\Prob[Y(e,M(e))]/\Prob[Y(e,M(e))]}{\Prob[Y(e^*,M(e^*))]/\Prob[Y(e^*,M(e^*))]} = \exp( (\beta_1 + \beta_2 \alpha_1)(e-e^*)) \]
#+END_EXPORT
for the natural direct effect:
#+BEGIN_EXPORT latex
\[ OR^{NDE} = \frac{\Prob[Y(e,M(e))]/\Prob[Y(e,M(e))]}{\Prob[Y(e^*,M(e))]/\Prob[Y(e^*,M(e))]} = \exp(\beta_1(e-e^*)) \]
#+END_EXPORT
for the natural indirect effect:
#+BEGIN_EXPORT latex
\[ OR^{NIE} = \frac{\Prob[Y(e^*,M(e))]/\Prob[Y(e^*,M(e))]}{\Prob[Y(e^*,M(e^*))]/\Prob[Y(e^*,M(e^*))]} = \exp(\beta_2\alpha_1(e-e^*)) \]
#+END_EXPORT
This matches formula in cite:vanderweele2010odds


\bigskip


Note that we can also express the total effect, natural direct effect,
and natural indirect effect on the probability scale, e.g.:
#+BEGIN_EXPORT latex
\begin{align*}
&\Prob[Y(e,M(e),c)=1] - \Prob[Y(e^*,M(e),c)=1] \\
&= \frac{1}{1+\exp^{-(\beta_0+\beta_2 \alpha_0) - (\beta_1 e + \beta_2 \alpha_1 e) + (\beta_3 + \beta_2 \alpha_3) c}}
- \frac{1}{1+\exp^{-(\beta_0+\beta_2 \alpha_0) - (\beta_1 e^* + \beta_2 \alpha_1 e) + (\beta_3 + \beta_2 \alpha_3) c}}
\end{align*}
#+END_EXPORT
which will be a function of the confounder value. To get a single
estimate we could average it out over the confounder distribution in
our population.

