doc/2023_02_09-mediation/post-mediation.org
** Practice

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
library(medflex)
data(UPBdata)
head(UPBdata)
sum(is.na(UPBdata))
#+END_SRC

#+RESULTS:
:          att attbin attcat     negaff  initiator gender educ age UPB
: 1  1.0005617      1      M  0.8404610     myself      F    M  41   1
: 2 -0.7085889      0      L -1.2574650       both      M    M  42   0
: 3 -0.7085889      0      L -1.2022564       both      F    H  43   0
: 4  0.6061423      1      M -0.3741277 ex-partner      M    H  52   1
: 5  0.2117230      1      M  1.9446325 ex-partner      M    M  32   1
: 6  2.0523467      1      H -0.8157964 ex-partner      M    H  47   0
: [1] 0

Manually
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
e.lm <- glm(negaff ~ factor(attbin) + gender + educ + age, data = UPBdata)
e.logit <- glm(UPB ~ attbin + negaff + gender + educ + age, family = binomial("logit"), data = UPBdata)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
exp(coef(e.logit)["attbin"])
exp(coef(e.logit)["negaff"]*coef(e.lm)["factor(attbin)1"])
#+END_SRC

#+RESULTS:
:   attbin 
: 1.550122
:  negaff 
: 1.41916

Using Medflex
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
expData <- neWeight(negaff ~ factor(attbin) + gender + educ + age, family = gaussian, data = UPBdata)
neMod1 <- neModel(UPB ~ attbin0 + attbin1 + gender + educ + age, family = binomial("logit"), expData = expData)
#+END_SRC

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
exp(cbind(estimate = coef(neMod1),confint(neMod1))[c("attbin01", "attbin11"), ])
#+END_SRC
#+RESULTS:
:          estimate  95% LCL  95% UCL
: attbin01 1.485757 0.946311 2.294548
: attbin11 1.421865 1.188970 1.678737

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
e.lm <- glm(negaff ~ factor(attbin), data = UPBdata)
e.logit <- glm(UPB ~ attbin + negaff, family = binomial("logit"), data = UPBdata)
#+END_SRC

#+RESULTS:

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
exp(coef(e.logit)["attbin"])
exp(coef(e.logit)["negaff"]*coef(e.lm)["factor(attbin)1"])
#+END_SRC

#+RESULTS:
:   attbin 
: 1.541862
:   negaff 
: 1.430096

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
expData <- neWeight(negaff ~ factor(attbin), family = gaussian, data = UPBdata)
neMod1 <- neModel(UPB ~ attbin0 + attbin1, family = binomial("logit"), expData = expData)
exp(cbind(estimate = coef(neMod1),confint(neMod1))[c("attbin01", "attbin11"), ])
#+END_SRC

#+RESULTS:
:   |                                                                              |                                                                      |   0%  |                                                                              |                                                                      |   1%  |                                                                              |=                                                                     |   1%  |                                                                              |=                                                                     |   2%  |                                                                              |==                                                                    |   2%  |                                                                              |==                                                                    |   3%  |                                                                              |==                                                                    |   4%  |                                                                              |===                                                                   |   4%  |                                                                              |===                                                                   |   5%  |                                                                              |====                                                                  |   5%  |                                                                              |====                                                                  |   6%  |                                                                              |=====                                                                 |   6%  |                                                                              |=====                                                                 |   7%  |                                                                              |=====                                                                 |   8%  |                                                                              |======                                                                |   8%  |                                                                              |======                                                                |   9%  |                                                                              |=======                                                               |   9%  |                                                                              |=======                                                               |  10%  |                                                                              |=======                                                               |  11%  |                                                                              |========                                                              |  11%  |                                                                              |========                                                              |  12%  |                                                                              |=========                                                             |  12%  |                                                                              |=========                                                             |  13%  |                                                                              |=========                                                             |  14%  |                                                                              |==========                                                            |  14%  |                                                                              |==========                                                            |  15%  |                                                                              |===========                                                           |  15%  |                                                                              |===========                                                           |  16%  |                                                                              |============                                                          |  16%  |                                                                              |============                                                          |  17%  |                                                                              |============                                                          |  18%  |                                                                              |=============                                                         |  18%  |                                                                              |=============                                                         |  19%  |                                                                              |==============                                                        |  19%  |                                                                              |==============                                                        |  20%  |                                                                              |==============                                                        |  21%  |                                                                              |===============                                                       |  21%  |                                                                              |===============                                                       |  22%  |                                                                              |================                                                      |  22%  |                                                                              |================                                                      |  23%  |                                                                              |================                                                      |  24%  |                                                                              |=================                                                     |  24%  |                                                                              |=================                                                     |  25%  |                                                                              |==================                                                    |  25%  |                                                                              |==================                                                    |  26%  |                                                                              |===================                                                   |  26%  |                                                                              |===================                                                   |  27%  |                                                                              |===================                                                   |  28%  |                                                                              |====================                                                  |  28%  |                                                                              |====================                                                  |  29%  |                                                                              |=====================                                                 |  29%  |                                                                              |=====================                                                 |  30%  |                                                                              |=====================                                                 |  31%  |                                                                              |======================                                                |  31%  |                                                                              |======================                                                |  32%  |                                                                              |=======================                                               |  32%  |                                                                              |=======================                                               |  33%  |                                                                              |=======================                                               |  34%  |                                                                              |========================                                              |  34%  |                                                                              |========================                                              |  35%  |                                                                              |=========================                                             |  35%  |                                                                              |=========================                                             |  36%  |                                                                              |==========================                                            |  36%  |                                                                              |==========================                                            |  37%  |                                                                              |==========================                                            |  38%  |                                                                              |===========================                                           |  38%  |                                                                              |===========================                                           |  39%  |                                                                              |============================                                          |  39%  |                                                                              |============================                                          |  40%  |                                                                              |============================                                          |  41%  |                                                                              |=============================                                         |  41%  |                                                                              |=============================                                         |  42%  |                                                                              |==============================                                        |  42%  |                                                                              |==============================                                        |  43%  |                                                                              |==============================                                        |  44%  |                                                                              |===============================                                       |  44%  |                                                                              |===============================                                       |  45%  |                                                                              |================================                                      |  45%  |                                                                              |================================                                      |  46%  |                                                                              |=================================                                     |  46%  |                                                                              |=================================                                     |  47%  |                                                                              |=================================                                     |  48%  |                                                                              |==================================                                    |  48%  |                                                                              |==================================                                    |  49%  |                                                                              |===================================                                   |  49%  |                                                                              |===================================                                   |  50%  |                                                                              |===================================                                   |  51%  |                                                                              |====================================                                  |  51%  |                                                                              |====================================                                  |  52%  |                                                                              |=====================================                                 |  52%  |                                                                              |=====================================                                 |  53%  |                                                                              |=====================================                                 |  54%  |                                                                              |======================================                                |  54%  |                                                                              |======================================                                |  55%  |                                                                              |=======================================                               |  55%  |                                                                              |=======================================                               |  56%  |                                                                              |========================================                              |  56%  |                                                                              |========================================                              |  57%  |                                                                              |========================================                              |  58%  |                                                                              |=========================================                             |  58%  |                                                                              |=========================================                             |  59%  |                                                                              |==========================================                            |  59%  |                                                                              |==========================================                            |  60%  |                                                                              |==========================================                            |  61%  |                                                                              |===========================================                           |  61%  |                                                                              |===========================================                           |  62%  |                                                                              |============================================                          |  62%  |                                                                              |============================================                          |  63%  |                                                                              |============================================                          |  64%  |                                                                              |=============================================                         |  64%  |                                                                              |=============================================                         |  65%  |                                                                              |==============================================                        |  65%  |                                                                              |==============================================                        |  66%  |                                                                              |===============================================                       |  66%  |                                                                              |===============================================                       |  67%  |                                                                              |===============================================                       |  68%  |                                                                              |================================================                      |  68%  |                                                                              |================================================                      |  69%  |                                                                              |=================================================                     |  69%  |                                                                              |=================================================                     |  70%  |                                                                              |=================================================                     |  71%  |                                                                              |==================================================                    |  71%  |                                                                              |==================================================                    |  72%  |                                                                              |===================================================                   |  72%  |                                                                              |===================================================                   |  73%  |                                                                              |===================================================                   |  74%  |                                                                              |====================================================                  |  74%  |                                                                              |====================================================                  |  75%  |                                                                              |=====================================================                 |  75%  |                                                                              |=====================================================                 |  76%  |                                                                              |======================================================                |  76%  |                                                                              |======================================================                |  77%  |                                                                              |======================================================                |  78%  |                                                                              |=======================================================               |  78%  |                                                                              |=======================================================               |  79%  |                                                                              |========================================================              |  79%  |                                                                              |========================================================              |  80%  |                                                                              |========================================================              |  81%  |                                                                              |=========================================================             |  81%  |                                                                              |=========================================================             |  82%  |                                                                              |==========================================================            |  82%  |                                                                              |==========================================================            |  83%  |                                                                              |==========================================================            |  84%  |                                                                              |===========================================================           |  84%  |                                                                              |===========================================================           |  85%  |                                                                              |============================================================          |  85%  |                                                                              |============================================================          |  86%  |                                                                              |=============================================================         |  86%  |                                                                              |=============================================================         |  87%  |                                                                              |=============================================================         |  88%  |                                                                              |==============================================================        |  88%  |                                                                              |==============================================================        |  89%  |                                                                              |===============================================================       |  89%  |                                                                              |===============================================================       |  90%  |                                                                              |===============================================================       |  91%  |                                                                              |================================================================      |  91%  |                                                                              |================================================================      |  92%  |                                                                              |=================================================================     |  92%  |                                                                              |=================================================================     |  93%  |                                                                              |=================================================================     |  94%  |                                                                              |==================================================================    |  94%  |                                                                              |==================================================================    |  95%  |                                                                              |===================================================================   |  95%  |                                                                              |===================================================================   |  96%  |                                                                              |====================================================================  |  96%  |                                                                              |====================================================================  |  97%  |                                                                              |====================================================================  |  98%  |                                                                              |===================================================================== |  98%  |                                                                              |===================================================================== |  99%  |                                                                              |======================================================================|  99%  |                                                                              |======================================================================| 100%>          estimate   95% LCL  95% UCL
: attbin01 1.467847 0.9419685 2.253654
: attbin11 1.437643 1.2003462 1.711461

#+BEGIN_SRC R :exports both :results output :session *R* :cache no
expData <- neImpute(UPB ~ factor(attbin) + negaff + gender + educ + age, family = binomial("logit"), data = UPBdata)
neMod1 <- neModel(UPB ~ attbin0 + attbin1 + gender + educ + age, family = binomial("logit"), expData = expData, se = "robust")
exp(cbind(estimate = coef(neMod1),confint(neMod1))[c("attbin01", "attbin11"), ])
#+END_SRC

#+RESULTS:
:          estimate   95% LCL  95% UCL
: attbin01 1.494111 0.9833185 2.270238
: attbin11 1.405922 1.2006238 1.646326

